public class Main {
    public static void main(String[] args) {

        Человек Максим = new Человек("Максим.", "Минск.", 1998,"бренд-менеджер.");
        Человек Аня = new Человек("Аня.", "Москва.", 1993, "методист образовательных программ.");
        Человек Катя = new Человек("Катя.", "Калининград.", 1992, "продакт-менеджер.");
        Человек Артем = new Человек("Артем.", "Москва.", 1995,"директор по развитию бизнеса.");
        System.out.println("Привет! Меня зовут " + Максим.name + " Я из города " + Максим.town + " Я родился в " + Максим.yearOfBirth + " году.Я работаю на должности " + Максим.jobTitle + " Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Аня.name + " Я из города " + Аня.town + " Я родился в " + Аня.yearOfBirth + " году.Я работаю на должности " + Аня.jobTitle + "  Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Катя.name + " Я из города " + Катя.town + " Я родился в " + Катя.yearOfBirth + " году. Я работаю на должности " + Катя.jobTitle + "  Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Артем.name + " Я из города " + Артем.town + " Я родился в " + Артем.yearOfBirth + " году. Я работаю на должности " + Артем.jobTitle + "  Будем знакомы!");


    }
}