public class Main {
    public static void main(String[] args) {

        //ООП. Урок 1 (введение, object). Домашнее задание 1,2
        // Задача 1,2,3
        // Домашнее задание 2. Задание 1,2
        System.out.println("ООП. Урок 1 (введение, object). Домашнее задание 1,2");
        Человек Максим = new Человек("Максим.", "Минск.", 1998,"бренд-менеджер.");
        Человек Аня = new Человек("Аня.", "Москва.", 1993, "методист образовательных программ.");
        Человек Катя = new Человек("Катя.", "Калининград.", 1992, "продакт-менеджер.");
        Человек Артем = new Человек("Артем.", "Москва.", 1995,"директор по развитию бизнеса.");

        System.out.println("Привет! Меня зовут " + Максим.name + " Я из города " + Максим.town + " Я родился в " + Максим.yearOfBirth + " году.Я работаю на должности " + Максим.jobTitle + " Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Аня.name + " Я из города " + Аня.town + " Я родился в " + Аня.yearOfBirth + " году.Я работаю на должности " + Аня.jobTitle + "  Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Катя.name + " Я из города " + Катя.town + " Я родился в " + Катя.yearOfBirth + " году. Я работаю на должности " + Катя.jobTitle + "  Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Артем.name + " Я из города " + Артем.town + " Я родился в " + Артем.yearOfBirth + " году. Я работаю на должности " + Артем.jobTitle + "  Будем знакомы!");
        System.out.println();


        Автомобиль Lada = new Автомобиль("Lada", "Granta", "объем двигателя - 1,7" , "желтого цвета", "2015 год выпуска" , " сборка в России");
        Lada.toString();
        Автомобиль Audi  = new Автомобиль("Audi ", "A8 50 L TDI quattro ", "объем двигателя — 3,0 л", "черный цвет кузова", " 2020 год выпуска" , " сборка в Германии,");
        Audi.toString();
        Автомобиль BMW  = new Автомобиль("BMW ", "Z8", "объем — 3,0 л.", "черный цвет кузова", " в 2021 году" , " сборка в Германиии");
        BMW.toString();
        Автомобиль Kia  = new Автомобиль("Kia", "Sportage 4-го поколения ", "объем двигателя — 2,4 л.", "цвет кузова — красный", " 2018 год выпуска" , " сборка в Южной Корее");
        Kia.toString();
        Автомобиль Hyundai  = new Автомобиль("Hyundai", "Avante 4-го поколения ", "объем двигателя — 1,6 л", "цвет кузова — оранжевый", "год выпуска — 2016 год." , " сборка в Южной Корее");
        Hyundai.toString();

        System.out.println(Lada.toString());
        System.out.println(Audi.toString());
        System.out.println(BMW.toString());
        System.out.println(Kia.toString());
        System.out.println(Hyundai.toString());
    }
}