public class Main {
    public static void main(String[] args) {

        //ООП. Урок 1 (введение, object). Домашнее задание 1,2
        // Задача 1,2,3
        // Домашнее задание 2. Задание 1,2
        System.out.println("ООП. Урок 1 (введение, object). Домашнее задание 1,2");
        Человек Максим = new Человек(null, "Минск.", 1998,"бренд-менеджер.");
        Человек Аня = new Человек("Аня.", "Москва.", 1993, "методист образовательных программ.");
        Человек Катя = new Человек("Катя.", " Калининград ", -1992, "продакт-менеджер.");
        Человек Артем = new Человек("Артем.", null, 1995,"директор по развитию бизнеса.");

        System.out.println("Привет! Меня зовут " + Максим.name + " Я из города " + Максим.town + " Я родился в " + Максим.yearOfBirth + " году.Я работаю на должности " + Максим.jobTitle + " Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Аня.name + " Я из города " + Аня.town + " Я родился в " + Аня.yearOfBirth + " году.Я работаю на должности " + Аня.jobTitle + "  Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Катя.name + " Я из города " + Катя.town + " Я родился в " + Катя.yearOfBirth + " году. Я работаю на должности " + Катя.jobTitle + "  Будем знакомы!");
        System.out.println("Привет! Меня зовут " + Артем.name + " Я из города " + Артем.town + " Я родился в " + Артем.yearOfBirth + " году. Я работаю на должности " + Артем.jobTitle + "  Будем знакомы!");
        System.out.println();


        Автомобиль car1 = new Автомобиль(2015,1.7,"желтый","Lada","Granta","Россия");
        Автомобиль car2 =new Автомобиль(2020, 0.0,"черный", "Audi","A8 50 L TDI quattro", "Германия");
        Автомобиль car3 =new Автомобиль(2021,3.0,"","BMW","Z8","Германия");
        Автомобиль car4 =new Автомобиль(2018,2.4,"красный","","Sportage 4-го поколения","Южная Корея");
        Автомобиль car5 =new Автомобиль(2016,1.6,"оранжевый","Hyundai","","");
        System.out.println(car1);
        System.out.println(car2);
        System.out.println(car3);
        System.out.println(car4);
        System.out.println(car5);
    }
}